---
type: MEPNetworkIterator
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 13
tags: [revit-api, class]
---

# MEPNetworkIterator

`Autodesk.Revit.DB.Analysis.MEPNetworkIterator` · Revit 2024 · 13 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | MEPNetworkIterator | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | End | 2024 | `public bool End ()` |
| Method | GetAnalyticalModelData | 2024 | `public MEPAnalyticalModelData GetAnalyticalModelData ()` |
| Method | GetAnalyticalNode | 2024 | `public MEPAnalyticalNode GetAnalyticalNode ()` |
| Method | GetAnalyticalSegment | 2024 | `public MEPAnalyticalSegment GetAnalyticalSegment ()` |
| Method | GetOtherAnalyticalNode | 2024 | `public MEPAnalyticalNode GetOtherAnalyticalNode ()` |
| Method | Next | 2024 | `public void Next ()` |
| Method | Start | 2024 | `public void Start ()` |
| Property | CurrentElementId | 2024 | `public ElementId CurrentElementId { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | SystemClassification | 2024 | `public MEPSystemClassification SystemClassification { get ; set ; }` |
| Property | SystemId | 2024 | `public ElementId SystemId { get ; set ; }` |